app/views/users/show.html.erb

                <td>
                  <%= link_to "#{book.book_comments.count} コメント", book_path(book.id) %>
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]