app/views/books/index.html.erb

                <td>
                  <%= link_to "#{book.book_comments.count} コメント", book_path(book.id) %>
---
SELECT "books".* FROM "books"